Tekla Open API Reference for Tekla Structures 2025
ViewVisibilitySettings Constructor
Initializes a new instance of the ViewVisibilitySettings class
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ViewVisibilitySettings()
Public Sub New
See Also
Reference
ViewVisibilitySettings Class
Tekla.Structures.Model.UI Namespace